In [2]:
import pandas as pd  # Import pandas

# Read the Titanic dataset
df_titanic = pd.read_csv(r"C:\Users\S\Downloads\Titanic.csv")

# Display the first few rows
print(df_titanic.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

In [3]:
# Rename columns
df_titanic = df_titanic.rename(columns={"Name": "Passenger_Name", "Ticket": "Ticket_Num"})

# Display the first few rows to verify
print(df_titanic.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

In [4]:
# Set "PassengerId" as the index
df_titanic = df_titanic.set_index("PassengerId")

# Display the first few rows to verify
print(df_titanic.head())

             Pclass                                Passenger_Name     Sex  \
PassengerId
892               3                              Kelly, Mr. James    male
893               3              Wilkes, Mrs. James (Ellen Needs)  female
894               2                     Myles, Mr. Thomas Francis    male
895               3                              Wirz, Mr. Albert    male
896               3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

              Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
PassengerId
892          34.5      0      0     330911   7.8292   NaN        Q
893          47.0      1      0     363272   7.0000   NaN        S
894          62.0      0      0     240276   9.6875   NaN        Q
895          27.0      0      0     315154   8.6625   NaN        S
896          22.0      1      1    3101298  12.2875   NaN        S

In [5]:
# Select the name of passenger with ID 896
passenger_896_name = df_titanic.loc[896, "Passenger_Name"]

# Display the result
print("Name of passenger 896:", passenger_896_name)

Name of passenger 896: Hirvonen, Mrs. Alexander (Helga E Lindqvist)

In [6]:
# Reset the index but keep PassengerId as a column
df_titanic = df_titanic.reset_index()

# Display the first few rows to verify
print(df_titanic.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

In [7]:
# Count missing values in the Age column
missing_age_count = df_titanic["Age"].isnull().sum()

# Display the result
print("Number of missing entries in the Age column:", missing_age_count)

Number of missing entries in the Age column: 86

In [8]:
# Compute the average age, ignoring missing values
avg_age = df_titanic["Age"].mean()

# Display the result
print("Average age of passengers (ignoring missing data):", avg_age)

Average age of passengers (ignoring missing data): 30.272590361445783

In [9]:
# Compute the mean age
mean_age = df_titanic["Age"].mean()

# Fill missing values in the Age column with the mean age
df_titanic["Age"] = df_titanic["Age"].fillna(mean_age)

# Verify that there are no missing values left
print("Missing values in Age column after filling:", df_titanic["Age"].isnull().sum())

Missing values in Age column after filling: 0

In [10]:
# Sort by Age in descending order and select the top 5 oldest passengers
oldest_5_avg_age = df_titanic.sort_values(by="Age", ascending=False).head(5)["Age"].mean()

# Display the result
print("Average age of the 5 oldest passengers:", oldest_5_avg_age)

Average age of the 5 oldest passengers: 67.0